<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc" style="margin-top: 1em;"><ul class="toc-item"><li><span><a href="#Chap5" data-toc-modified-id="Chap5-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Chap5</a></span><ul class="toc-item"><li><span><a href="#全部のColumnでどの値が何回出てるか調べる（HistGram的）" data-toc-modified-id="全部のColumnでどの値が何回出てるか調べる（HistGram的）-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span>全部のColumnでどの値が何回出てるか調べる（HistGram的）</a></span></li></ul></li><li><span><a href="#Chap6" data-toc-modified-id="Chap6-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Chap6</a></span><ul class="toc-item"><li><span><a href="#mapの使い方" data-toc-modified-id="mapの使い方-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>mapの使い方</a></span></li><li><span><a href="#数字をカテゴリーに分ける（Cut）" data-toc-modified-id="数字をカテゴリーに分ける（Cut）-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>数字をカテゴリーに分ける（Cut）</a></span><ul class="toc-item"><li><span><a href="#18---25,-26---35,-36---60" data-toc-modified-id="18---25,-26---35,-36---60-2.2.1"><span class="toc-item-num">2.2.1&nbsp;&nbsp;</span>18 - 25, 26 - 35, 36 - 60</a></span></li><li><span><a href="#name-categories" data-toc-modified-id="name-categories-2.2.2"><span class="toc-item-num">2.2.2&nbsp;&nbsp;</span>name categories</a></span></li><li><span><a href="#勝手にBinに仕分ける方法" data-toc-modified-id="勝手にBinに仕分ける方法-2.2.3"><span class="toc-item-num">2.2.3&nbsp;&nbsp;</span>勝手にBinに仕分ける方法</a></span><ul class="toc-item"><li><span><a href="#Cutは適当にBinにいれる、QcutはBinを同じぐらいにしてくれる" data-toc-modified-id="Cutは適当にBinにいれる、QcutはBinを同じぐらいにしてくれる-2.2.3.1"><span class="toc-item-num">2.2.3.1&nbsp;&nbsp;</span>Cutは適当にBinにいれる、QcutはBinを同じぐらいにしてくれる</a></span></li></ul></li></ul></li></ul></li><li><span><a href="#Chap8" data-toc-modified-id="Chap8-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>Chap8</a></span><ul class="toc-item"><li><span><a href="#Hierarchical-Index" data-toc-modified-id="Hierarchical-Index-3.1"><span class="toc-item-num">3.1&nbsp;&nbsp;</span>Hierarchical Index</a></span><ul class="toc-item"><li><span><a href="#Series" data-toc-modified-id="Series-3.1.1"><span class="toc-item-num">3.1.1&nbsp;&nbsp;</span>Series</a></span></li><li><span><a href="#DataFrame" data-toc-modified-id="DataFrame-3.1.2"><span class="toc-item-num">3.1.2&nbsp;&nbsp;</span>DataFrame</a></span><ul class="toc-item"><li><span><a href="#Index,-Columnの階層ごとに名前をつける" data-toc-modified-id="Index,-Columnの階層ごとに名前をつける-3.1.2.1"><span class="toc-item-num">3.1.2.1&nbsp;&nbsp;</span>Index, Columnの階層ごとに名前をつける</a></span></li><li><span><a href="#SwapLeve" data-toc-modified-id="SwapLeve-3.1.2.2"><span class="toc-item-num">3.1.2.2&nbsp;&nbsp;</span>SwapLeve</a></span></li></ul></li></ul></li><li><span><a href="#Reshape" data-toc-modified-id="Reshape-3.2"><span class="toc-item-num">3.2&nbsp;&nbsp;</span>Reshape</a></span><ul class="toc-item"><li><span><a href="#Stack-and-Unstack" data-toc-modified-id="Stack-and-Unstack-3.2.1"><span class="toc-item-num">3.2.1&nbsp;&nbsp;</span>Stack and Unstack</a></span><ul class="toc-item"><li><span><a href="#axisにごとにunstackできる" data-toc-modified-id="axisにごとにunstackできる-3.2.1.1"><span class="toc-item-num">3.2.1.1&nbsp;&nbsp;</span>axisにごとにunstackできる</a></span></li></ul></li><li><span><a href="#PIVOT" data-toc-modified-id="PIVOT-3.2.2"><span class="toc-item-num">3.2.2&nbsp;&nbsp;</span><a href="https://pandas.pydata.org/pandas-docs/stable/reshaping.html" target="_blank">PIVOT</a></a></span></li><li><span><a href="#Melt" data-toc-modified-id="Melt-3.2.3"><span class="toc-item-num">3.2.3&nbsp;&nbsp;</span>Melt</a></span></li></ul></li></ul></li><li><span><a href="#Chap-10" data-toc-modified-id="Chap-10-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Chap 10</a></span></li></ul></div>

# Chap5

## 全部のColumnでどの値が何回出てるか調べる（HistGram的）

In [1]:
import pandas as pd

df = pd.DataFrame(
    {
        'a': [1,2,3,4,5],
        'b': [2,4,6,8,10],
        'c': [1, 3, 6, 9, 12],
    }
)

df.apply(pd.value_counts)

      a    b    c
1   1.0  NaN  1.0
2   1.0  1.0  NaN
3   1.0  NaN  1.0
4   1.0  1.0  NaN
5   1.0  NaN  NaN
6   NaN  1.0  1.0
8   NaN  1.0  NaN
9   NaN  NaN  1.0
10  NaN  1.0  NaN
12  NaN  NaN  1.0

In [2]:
df.apply(pd.value_counts).fillna(0)

      a    b    c
1   1.0  0.0  1.0
2   1.0  1.0  0.0
3   1.0  0.0  1.0
4   1.0  1.0  0.0
5   1.0  0.0  0.0
6   0.0  1.0  1.0
8   0.0  1.0  0.0
9   0.0  0.0  1.0
10  0.0  1.0  0.0
12  0.0  0.0  1.0

# Chap6

## mapの使い方

In [3]:
import pandas as pd

def test(x):
    return x

df = pd.DataFrame({
    'value': range(21),
})

df['value'].map(test)

0      0
1      1
2      2
3      3
4      4
5      5
6      6
7      7
8      8
9      9
10    10
11    11
12    12
13    13
14    14
15    15
16    16
17    17
18    18
19    19
20    20
Name: value, dtype: int64

In [4]:
import pandas as pd

def test(x):
    if x % 3 == 0:
        return 'fiz'
    elif x % 2 == 0:
        return 'buz'
    else:
        return 'fizbuz'

df = pd.DataFrame({
    'value': range(21),
})

df['value'].map(test)

0        fiz
1     fizbuz
2        buz
3        fiz
4        buz
5     fizbuz
6        fiz
7     fizbuz
8        buz
9        fiz
10       buz
11    fizbuz
12       fiz
13    fizbuz
14       buz
15       fiz
16       buz
17    fizbuz
18       fiz
19    fizbuz
20       buz
Name: value, dtype: object

## 数字をカテゴリーに分ける（Cut）

### 18 - 25, 26 - 35, 36 - 60

In [5]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 41, 32]
bins = [18, 25, 35, 60, 100]

cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (35, 60], (25, 35], (60, 100], (35, 60], (25, 35]]
Length: 11
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [6]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 1], dtype=int8)

In [7]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]]
              closed='right',
              dtype='interval[int64]')

In [8]:
cats.categories[1]

Interval(25, 35, closed='right')

In [9]:
pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     2
(60, 100]    1
dtype: int64

### name categories

In [10]:
group_names  = ['youth', 'young-adult', 'middle-aged', 'senior']

pd.cut(ages, bins, labels=group_names)

[youth, youth, youth, young-adult, youth, ..., middle-aged, young-adult, senior, middle-aged, young-adult]
Length: 11
Categories (4, object): [youth < young-adult < middle-aged < senior]

### 勝手にBinに仕分ける方法

In [11]:
# 4つのBin
data = range(20)
cate = pd.cut(data, 4, precision=2)
pd.value_counts(cate)

(14.25, 19.0]     5
(9.5, 14.25]      5
(4.75, 9.5]       5
(-0.019, 4.75]    5
dtype: int64

In [12]:
# 2つのBin
data = range(13)
cate = pd.cut(data, 2, precision=2)
pd.value_counts(cate)

(-0.012, 6.0]    7
(6.0, 12.0]      6
dtype: int64

#### Cutは適当にBinにいれる、QcutはBinを同じぐらいにしてくれる

In [13]:
# qcutだとRandomNumでもBinのサイズを同じぐらいにしてくれる
import numpy as np
data = np.random.randn(1000)
cate = pd.qcut(data, 4)
pd.value_counts(cate)

(0.66, 2.738]                    250
(0.0204, 0.66]                   250
(-0.623, 0.0204]                 250
(-2.9699999999999998, -0.623]    250
dtype: int64

In [14]:
# cut だと都合よくいかない
import numpy as np
data = np.random.randn(1000)
cate = pd.cut(data, 4)
pd.value_counts(cate)

(-0.229, 1.272]     500
(-1.729, -0.229]    357
(1.272, 2.772]      107
(-3.235, -1.729]     36
dtype: int64

# Chap8

## Hierarchical Index

### Series

In [15]:
import pandas as pd
import numpy as np
ds = pd.Series(np.random.randn(9),
          index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                 [1,2,3,1,3,1,2,2,3]])
ds

a  1   -0.338533
   2    0.426812
   3   -1.319477
b  1   -0.636859
   3    0.543518
c  1    0.842074
   2   -1.391252
d  2   -0.717268
   3   -1.115478
dtype: float64

In [16]:
ds.index

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 2, 0, 1, 1, 2]])

In [17]:
ds['b']

1   -0.636859
3    0.543518
dtype: float64

In [18]:
ds['b':'c']

b  1   -0.636859
   3    0.543518
c  1    0.842074
   2   -1.391252
dtype: float64

In [19]:
ds[['b', 'd']]

b  1   -0.636859
   3    0.543518
d  2   -0.717268
   3   -1.115478
dtype: float64

In [20]:
ds.loc[['b', 'd']]

b  1   -0.636859
   3    0.543518
d  2   -0.717268
   3   -1.115478
dtype: float64

In [21]:
ds.unstack()

          1         2         3
a -0.338533  0.426812 -1.319477
b -0.636859       NaN  0.543518
c  0.842074 -1.391252       NaN
d       NaN -0.717268 -1.115478

In [22]:
ds.unstack().stack()

a  1   -0.338533
   2    0.426812
   3   -1.319477
b  1   -0.636859
   3    0.543518
c  1    0.842074
   2   -1.391252
d  2   -0.717268
   3   -1.115478
dtype: float64

### DataFrame

In [23]:
import pandas as pd
import numpy as np
frame = pd.DataFrame(np.arange(12).reshape((4, 3)),
                     index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                     columns=[['Ohio', 'Ohio', 'Colorado'],
                              ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

#### Index, Columnの階層ごとに名前をつける

In [24]:
frame.index.names = ['key1', 'key2'] # インデックスの階層ごとに名前をつける
frame.columns.names = ['state', 'color'] # Columnの階層ごとに名前をつける

In [25]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

#### SwapLeve

In [26]:
frame.swaplevel('key1','key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

###### MultiLevelIndexでソートする

In [27]:
frame.sort_index(level=1)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [28]:
frame.sort_index(level=0)

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

## Reshape

### Stack and Unstack

- stack
  - This “rotates” or pivots from the columns in the data to the rows
- unstack
  - This pivots from the rows into the columns

In [31]:
data = pd.DataFrame(np.arange(6).reshape((2, 3)),
                    index=pd.Index(['Ohio', 'Colorado'], name='state'),
                    columns=pd.Index(['one', 'two', 'three'],
                                     name='number'))
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [34]:
res = data.stack()
res

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int64

In [35]:
res.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

#### axisにごとにunstackできる

In [36]:
res.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [37]:
res.unstack(1)

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [39]:
res.unstack('state') # index や Columnの名前でも良い

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

### [PIVOT](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)

In [42]:
import pandas.util.testing as tm; tm.N = 3
def unpivot(frame):
    N, K = frame.shape
    data = {'value' : frame.values.ravel('F'),
            'variable' : np.asarray(frame.columns).repeat(N),
            'date' : np.tile(np.asarray(frame.index), K)}
    return pd.DataFrame(data, columns=['date', 'variable', 'value'])
df = unpivot(tm.makeTimeDataFrame())
df

         date variable     value
0  2000-01-03        A  1.569804
1  2000-01-04        A -0.874745
2  2000-01-05        A -1.193135
3  2000-01-03        B -0.560272
4  2000-01-04        B -0.720055
5  2000-01-05        B  0.914328
6  2000-01-03        C -1.224004
7  2000-01-04        C  1.014841
8  2000-01-05        C  0.637724
9  2000-01-03        D  0.951719
10 2000-01-04        D -0.324307
11 2000-01-05        D -0.013886

In [43]:
df.pivot(index='date', columns='variable', values='value')

variable           A         B         C         D
date
2000-01-03  1.569804 -0.560272 -1.224004  0.951719
2000-01-04 -0.874745 -0.720055  1.014841 -0.324307
2000-01-05 -1.193135  0.914328  0.637724 -0.013886

In [44]:
df.pivot(index='variable', columns='date', values='value')

date      2000-01-03  2000-01-04  2000-01-05
variable
A           1.569804   -0.874745   -1.193135
B          -0.560272   -0.720055    0.914328
C          -1.224004    1.014841    0.637724
D           0.951719   -0.324307   -0.013886

In [46]:
df.pivot(index='value', columns='date', values='variable')

date      2000-01-03 2000-01-04 2000-01-05
value
-1.224004          C       None       None
-1.193135       None       None          A
-0.874745       None          A       None
-0.720055       None          B       None
-0.560272          B       None       None
-0.324307       None          D       None
-0.013886       None       None          D
 0.637724       None       None          C
 0.914328       None       None          B
 0.951719          D       None       None
 1.014841       None          C       None
 1.569804          A       None       None

### Melt

pivot => Transform one column into many   
melt => merges multiple column into one

In [48]:
df = pd.DataFrame({'key': ['foo', 'bar', 'baz'],
                   'A': [1, 2, 3],
                   'B': [4, 5, 6],
                   'C': [7, 8, 9]})
df

   A  B  C  key
0  1  4  7  foo
1  2  5  8  bar
2  3  6  9  baz

In [55]:
df2 = pd.melt(df, ['key']).sort_values(by='key', ascending=False)
df2

   key variable  value
0  foo        A      1
3  foo        B      4
6  foo        C      7
2  baz        A      3
5  baz        B      6
8  baz        C      9
1  bar        A      2
4  bar        B      5
7  bar        C      8

In [56]:
df3 = pd.melt(df, ['A'])
df3

   A variable value
0  1        B     4
1  2        B     5
2  3        B     6
3  1        C     7
4  2        C     8
5  3        C     9
6  1      key   foo
7  2      key   bar
8  3      key   baz

In [58]:
df2.pivot('key', 'variable', 'value') # Meltされたものに、Pivotするともとにもどる

variable  A  B  C
key
bar       2  5  8
baz       3  6  9
foo       1  4  7

# Chap 10